matteogastaldello/msp432-endpoint/main.c
#include "simplelink.h"
#include "sl_common.h"

//code libraries
#include <stdio.h>
#include <net/bsd/netdb.h>
#include <net/bsd/netinet/in.h>
#include <stdlib.h>
#include <string.h>
#include <socket.h>
#include <sys/types.h>
#include <unistd.h> // read(), write(), close()

#include <driverlib.h>
//LcdDriver
#include <msp.h>
#include <ti/grlib/grlib.h>
#include "LcdDriver/Crystalfontz128x128_ST7735.h"
#include "LcdDriver/HAL_MSP_EXP432P401R_Crystalfontz128x128_ST7735.h"
#include "HAL/HAL_I2C.h"
#include "HAL/HAL_TMP006.h"
#include <stdio.h>
#include <string.h>

//COMMUNICATION
#define MAX 80
#define PORT 8080
#define SA struct sockaddr
//CommProtocol
#define HANDSHAKE_ACK  "HANDSHAKE_ACK"

//LCD
#define SELECTED_COLOR 25500
#define MENU_SIZE 3
#define INTERFACES_DIM_MAX 5
#define DATA_BUFFER_DIM 10

/*
 * Values for below macros shall be modified per the access-point's (AP) properties
 * SimpleLink device will connect to following AP when the application is executed
 */
#define SSID_NAME       "MspNet"       /* Access point name to connect to. */
#define SEC_TYPE        SL_SEC_TYPE_WPA_WPA2     /* Security type of the Access piont */
#define PASSKEY         "mspmatteo"   /* Password in case of secure AP */
#define PASSKEY_LEN     pal_Strlen(PASSKEY)      /* Password length in case of secure AP */

#define APPLICATION_VERSION "1.0.0"
///http start
#define SL_STOP_TIMEOUT        0xFF
#define SMALL_BUF           32
#define MAX_SEND_BUF_SIZE   512
#define MAX_SEND_RCV_SIZE   1024



bool isConfigurationMode = false;
//tcp var
int sockfd, connfd, len;
struct sockaddr_in servaddr, cli;
int firstStart;


/*
 * STATIC FUNCTION DEFINITIONS -- Start
 */
static _i32 establishConnectionWithAP();
static _i32 disconnectFromAP();
static _i32 configureSimpleLinkToDefaultState();
static _i32 initializeAppVariables();
static void displayBanner();
static _i32 getHostIP();
static _i32 createConnection();

char* itoa(int n, char *s)
{
    int i, sign;

    if ((sign = n) < 0) /* tiene traccia del segno */
        n = -n; /* rende n positivo */
    i = 0;
    do
    { /* genera le cifre nell'ordine inverso */
        s[i++] = n % 10 + '0'; /* estrae la cifra seguente */
    }
    while ((n /= 10) > 0); /* elimina la cifra da n */
    if (sign < 0)
        s[i++] = '-';
    s[i] = '\0';
    //reverse(s);

    return s;
}

typedef struct
{
    int currentPos;
    float bufferData[DATA_BUFFER_DIM];
} Data_t;

Data_t tempData;

int back = 0;
int pressed = 0;
int currentState;
int selectedElement = 0;
int samplingStop;
int rerender;

/* Graphic library context */
Graphics_Context g_sContext;

/* ADC results buffer */
static uint16_t resultsBuffer[2];

typedef void (*behaviour_t)();

typedef struct
{
    // element selection
    int selectedElement;
    int (*selectionFunction)();

    // interfaces handling
    int interfacesDim;
    int selectedInterface;
    void (*interfaces[INTERFACES_DIM_MAX])();

    // behaviour
    behaviour_t behaviours[INTERFACES_DIM_MAX];

} State_t;

State_t states[4];
Graphics_Rectangle menuRectangles[MENU_SIZE];

int communicationRoutine();

//-------------------------------------MENU STATE----------------------------

void menuRectanglesInit()
{

    int height = 30;
    int space = 10;

//       Graphics_Rectangle choice0;  // pairing state
//       choice0.xMin = 10;
//       choice0.xMax = 128-choice0.xMin;
//       choice0.yMin = 10;
//       choice0.yMax = choice0.yMin + height;

//      Graphics_Rectangle choice1;  // normal mode
//      choice1.xMin = choice0.xMin;
//      choice1.xMax = choice0.xMax;
//      choice1.yMin = choice0.yMax + space;
//      choice1.yMax = choice1.yMin + height;

//       Graphics_Rectangle choice2;  // communication mode
//       choice2.xMin = choice0.xMin;
//       choice2.xMax = choice0.xMax;
//       choice2.yMin = choice1.yMax + space;
//       choice2.yMax = choice2.yMin + height;

//       menuRectangles[0] = choice0;
//       menuRectangles[1] = choice1;
//       menuRectangles[2] = choice2;

    menuRectangles[0].xMin = 5;
    menuRectangles[0].xMax = 128 - menuRectangles[0].xMin;
    menuRectangles[0].yMin = 5;
    menuRectangles[0].yMax = menuRectangles[0].yMin + height;

    menuRectangles[1].xMin = menuRectangles[0].xMin;
    menuRectangles[1].xMax = menuRectangles[0].xMax;
    menuRectangles[1].yMin = menuRectangles[0].yMax + space;
    menuRectangles[1].yMax = menuRectangles[1].yMin + height;

    menuRectangles[2].xMin = menuRectangles[0].xMin;
    menuRectangles[2].xMax = menuRectangles[0].xMax;
    menuRectangles[2].yMin = menuRectangles[1].yMax + space;
    menuRectangles[2].yMax = menuRectangles[2].yMin + height;

}

void menuInterfaceRender()
{
    Graphics_clearDisplay(&g_sContext);

    int i = 0;

    for (i; i < MENU_SIZE; i++)
    {
        Graphics_drawRectangle(&g_sContext, &menuRectangles[i]);
    }

    Graphics_fillRectangle(&g_sContext, &menuRectangles[selectedElement]);

    Graphics_drawStringCentered(
            &g_sContext, (int8_t*) "PAIRING MODE", 18, 64,
            (menuRectangles[0].yMax + menuRectangles[0].yMin) / 2, OPAQUE_TEXT);
    Graphics_drawStringCentered(
            &g_sContext, (int8_t*) "NORMAL MODE", 18, 64,
            (menuRectangles[1].yMax + menuRectangles[1].yMin) / 2, OPAQUE_TEXT);
    Graphics_drawStringCentered(
            &g_sContext, (int8_t*) "COMMUNICATION MODE", 18, 64,
            (menuRectangles[2].yMax + menuRectangles[2].yMin) / 2, OPAQUE_TEXT);

}

void menuStateBehaviour()
{

    //menuInterfaceRender();

}

int menuSelectionFunction()
{
    //char string[30];

    //renderStop = 0;
    int intermediateValue;

    if (samplingStop == 0)
    {
        if (resultsBuffer[1] > 16330)    // joystick turned up
        {
            selectedElement--;
            samplingStop = 1;
            rerender = 1;

