matteogastaldello/msp432-endpoint/main.c
        }
        else if (resultsBuffer[1] < 50)    // joystick turned down
        {
            selectedElement++;
            samplingStop = 1;
            rerender = 1;
            //Graphics_drawStringCentered(&g_sContext,(int8_t *)string,18,64,50,OPAQUE_TEXT);

        }

        if (selectedElement < 0)
        {
            selectedElement = MENU_SIZE + selectedElement;
        }

        intermediateValue = selectedElement % MENU_SIZE;
        selectedElement = intermediateValue % MENU_SIZE;

        //sprintf(string, "SElem : %d",selectedElement);
        //Graphics_drawStringCentered(&g_sContext,(int8_t *)string,30,64,50,OPAQUE_TEXT);

        int i = 0;
        for (i; i < 300250; i++)
            ;   // busy wait per scandire il tempo di campionamento

        //Graphics_drawStringCentered(&g_sContext,(int8_t *) itoa(selectedElement,string) ,4,64,50,OPAQUE_TEXT);
//       if (rerender==1)
//       {
//           menuInterfaceRender();
//           rerender = 0;
//       }

        if (!(P4IN & GPIO_PIN1) && pressed == 0)
        {
            //     Graphics_clearDisplay(&g_sContext);
            //     Graphics_drawStringCentered(&g_sContext,(int8_t*) "PRESSED",7,64,64,OPAQUE_TEXT);
            currentState = selectedElement;

            pressed = 1;
            rerender = 1;

            int i = 0;
            for (i; i < 300250; i++)
                ;   // busy wait per scandire il tempo di campionamento

            pressed = 0;

            //interfacePlaceholder(); //*(states[currentState].interfaces[states[currentState].selectedInterface])();
        }

    }

    samplingStop = 0;

    return 0;
}

//-------------------------------------NORMAL STATE----------------------------

void normalModeRender()
{
    Graphics_clearDisplay(&g_sContext);
    //Graphics_drawRectangle(&g_sContext,&menuRectangles[0]);
    /* Display temperature */
    char string[30];
    sprintf(string, "CURRENT : %f", tempData.bufferData[tempData.currentPos]);
    Graphics_drawStringCentered(&g_sContext, (int8_t*) string, 11, 55, 70,
    OPAQUE_TEXT);
}

void normalModeBehaviour()
{

    /* Obtain temperature value from TMP006 */
    tempData.bufferData[tempData.currentPos] = TMP006_getTemp();
    //normalModeRender(); // andr� sostituito con (*states[currenttState].interfaces[selectedInterface])();

    int partialPos = tempData.currentPos++;
    tempData.currentPos = partialPos % DATA_BUFFER_DIM;

}

//-------------------------------------PAIRING STATE----------------------------

void pairingInterfaceRender()
{
    Graphics_clearDisplay(&g_sContext);
    Graphics_drawStringCentered(&g_sContext, (int8_t*) "Pairing", 7, 64, 30,
    OPAQUE_TEXT);
}

void pairingBehaviour()
{
    //(*states[currentState].interfaces[states[currentState].selectedInterface])();

    // add pairing code HERE

}

//-------------------------------------COMMUNICATION STATE----------------------------

void communicationInterfaceRender()
{
    Graphics_clearDisplay(&g_sContext);

    char title[20];
    sprintf(title, "%s", "COLLECTED DATA");

    char dataString[60];
    int i = 0;
    char space[] = " ";

    for (i; i < DATA_BUFFER_DIM; i++)
    {
        char currentData[5];
        itoa(tempData.bufferData[0], currentData);
        strncat(dataString, currentData, 2);
        strncat(dataString, space, 1);
    }

    Graphics_drawStringCentered(&g_sContext, (int8_t*) title, 14, 64, 5,
    OPAQUE_TEXT);
    Graphics_drawStringCentered(&g_sContext, (int8_t*) dataString, 60, 64, 20,
    OPAQUE_TEXT);

}

void interfacePlaceholder()
{
    Graphics_clearDisplay(&g_sContext);
    Graphics_drawStringCentered(&g_sContext, (int8_t*) "INTERFACE PLACEHOLDER",
                                21, 64, 50, OPAQUE_TEXT);

}

void noBehaviour()
{

    //(*states[currentState].interfaces[states[currentState].selectedInterface])();

}

int noSelectionFunction()
{
    return 0;
}

int backSelectionFunction()
{
    if (!(P4IN & GPIO_PIN1))
    {
        Graphics_clearDisplay(&g_sContext);
        Graphics_drawStringCentered(&g_sContext, (int8_t*) "BACK FUNC", 9, 64,
                                    10, OPAQUE_TEXT);
        currentState = 3;

        rerender = 1;
        //interfacePlaceholder(); //*(states[currentState].interfaces[states[currentState].selectedInterface])();
    }
    return 0;
}

void render()
{
    if (rerender == 1)
    {
        (*states[currentState].interfaces[states[currentState].selectedInterface])();
        rerender = 0;
    }

}

void statesInitializer()
{
    // states are sorted thinking about the flow interactions should follow --- pairing, then collecting data, then communication to send it
    // menu is put at the last one and will be avoided scrolling using the joystick

    // states[0] initialization -- pairing state

    states[0].selectedElement = -1;
    states[0].selectionFunction = &communicationRoutine;
    states[0].interfacesDim = 3; //pairing,paired,error
    states[0].selectedInterface = 0;
    states[0].interfaces[0] = &pairingInterfaceRender;           //ok
    states[0].behaviours[0] = &pairingBehaviour;

    // states[1] initialization -- normal state

    states[1].selectedElement = -1;
    states[1].selectionFunction = &noSelectionFunction;
    states[1].interfacesDim = 1;   // mostra i dati irt
    states[1].selectedInterface = 0;
    states[1].interfaces[0] = &normalModeRender;
    states[1].behaviours[0] = &normalModeBehaviour;

    // states[2] initialization -- communication state

    states[2].selectedElement = -1;
    states[2].selectionFunction = &noSelectionFunction;
    states[2].interfacesDim = 3; // sending, ok,error
    states[2].selectedInterface = 0;
    states[2].interfaces[0] = &communicationInterfaceRender;            //ok
    states[2].behaviours[0] = &noBehaviour;

