matteogastaldello/msp432-endpoint/main.c
    // states[3] initialization -- menu state

    states[3].selectedElement = 0;
    states[3].selectionFunction = &menuSelectionFunction;
    states[3].interfacesDim = 1; // 1 per ogni rettangolo selezionabile
    states[3].selectedInterface = 0;
    states[3].interfaces[0] = &menuInterfaceRender;         //ok
    states[3].behaviours[0] = &menuStateBehaviour;
}

void _adcInit()
{
    /* Configures Pin 6.0 and 4.4 as ADC input */
    GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P6, GPIO_PIN0,
    GPIO_TERTIARY_MODULE_FUNCTION);
    GPIO_setAsPeripheralModuleFunctionInputPin(GPIO_PORT_P4, GPIO_PIN4,
    GPIO_TERTIARY_MODULE_FUNCTION);

    /* Initializing ADC (ADCOSC/64/8) */
    ADC14_enableModule();
    ADC14_initModule(ADC_CLOCKSOURCE_ADCOSC, ADC_PREDIVIDER_64, ADC_DIVIDER_8,
                     0);

    /* Configuring ADC Memory (ADC_MEM0 - ADC_MEM1 (A15, A9)  with repeat)
     * with internal 2.5v reference */
    ADC14_configureMultiSequenceMode(ADC_MEM0, ADC_MEM1, true);
    ADC14_configureConversionMemory(ADC_MEM0,
    ADC_VREFPOS_AVCC_VREFNEG_VSS,
                                    ADC_INPUT_A15, ADC_NONDIFFERENTIAL_INPUTS);

    ADC14_configureConversionMemory(ADC_MEM1,
    ADC_VREFPOS_AVCC_VREFNEG_VSS,
                                    ADC_INPUT_A9, ADC_NONDIFFERENTIAL_INPUTS);

    /* Enabling the interrupt when a conversion on channel 1 (end of sequence)
     *  is complete and enabling conversions */
    ADC14_enableInterrupt(ADC_INT1);

    /* Enabling Interrupts */
    Interrupt_enableInterrupt(INT_ADC14);
    Interrupt_enableMaster();

    /* Setting up the sample timer to automatically step through the sequence
     * convert.
     */
    ADC14_enableSampleTimer(ADC_AUTOMATIC_ITERATION);

    /* Triggering the start of the sample */
    ADC14_enableConversion();
    ADC14_toggleConversionTrigger();
}

void _graphicsInit()
{
    /* Initializes display */
    Crystalfontz128x128_Init();

    /* Set default screen orientation */
    Crystalfontz128x128_SetOrientation(LCD_ORIENTATION_UP);

    /* Initializes graphics context */
    Graphics_initContext(&g_sContext, &g_sCrystalfontz128x128,
                         &g_sCrystalfontz128x128_funcs);
    Graphics_setForegroundColor(&g_sContext, GRAPHICS_COLOR_RED);
    Graphics_setBackgroundColor(&g_sContext, GRAPHICS_COLOR_WHITE);
    GrContextFontSet(&g_sContext, &g_sFontFixed6x8);
    Graphics_clearDisplay(&g_sContext);

}

//void _lightSensorInit()
//{
//    /* Initialize I2C communication */
//    Init_I2C_GPIO();
//    I2C_init();
//
//    /* Initialize OPT3001 digital ambient light sensor */
//    OPT3001_init();
//
//    __delay_cycles(100000);
//
//}

void _temperatureSensorInit()
{
    /* Temperature Sensor initialization */
    /* Initialize I2C communication */
    Init_I2C_GPIO();
    I2C_init();
    /* Initialize TMP006 temperature sensor */
    TMP006_init();
    __delay_cycles(100000);

}

void _hwInit()
{
    /* Halting WDT and disabling master interrupts */
    WDT_A_holdTimer();
    Interrupt_disableMaster();

    /* Set the core voltage level to VCORE1 */
    PCM_setCoreVoltageLevel(PCM_VCORE1);

    /* Set 2 flash wait states for Flash bank 0 and 1*/
    FlashCtl_setWaitState(FLASH_BANK0, 2);
    FlashCtl_setWaitState(FLASH_BANK1, 2);

    /* Initializes Clock System */
    CS_setDCOCenteredFrequency(CS_DCO_FREQUENCY_48);
    CS_initClockSignal(CS_MCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_HSMCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_SMCLK, CS_DCOCLK_SELECT, CS_CLOCK_DIVIDER_1);
    CS_initClockSignal(CS_ACLK, CS_REFOCLK_SELECT, CS_CLOCK_DIVIDER_1);

    _graphicsInit();
    _adcInit();
    //_temperatureSensorInit();

    menuRectanglesInit();
    statesInitializer();
//
//
//
//
//
    tempData.currentPos = 0;

    int i = 0;

    for (i; i < DATA_BUFFER_DIM; i++)
    {
        tempData.bufferData[i] = 0;
    }
//
////    _lightSensorInit();
//
    //COME SARA ' :
    currentState = 3; // at init time starts form menuState
    rerender = 1;
    samplingStop = 0;

//
//    // TEST
//

}

/*
 * Main function
 */
int main(void)
{

    _hwInit();

    _i32 retVal = -1;
    firstStart = true;
    retVal = initializeAppVariables();
    ASSERT_ON_ERROR(retVal);
    /* Stop WDT and initialize the system-clock of the MCU */
    stopWDT();
    interruptSetup();
    initClk();
    /* Configure command line interface */
    CLI_Configure();

    while (1)
    {

    }

    return 0;

//    //Graphics_drawStringCentered(&g_sContext,(int8_t*)"EHI",3,64,64,OPAQUE_TEXT);
//
//
//    while(1)
//    {
//        //render();
//        //(*states[currentState].behaviours[0])();
//    }

    //menuInterfaceRender();
    //menuStateBehaviour();

//    while (1)
//    {
//        int i = 0;
//        __delay_cycles(100000);
//        pairingViewDynamic(pos);
//        for(i ; i<20000;i++);
//        pos++;
//
//    }

}

//        while (1)
//        {
//            /* Obtain lux value from OPT3001 */
//            lux = OPT3001_getLux();
//
//            char string[20];
//            sprintf(string, "%f", lux);
//            Graphics_drawStringCentered(&g_sContext, (int8_t *) string, 6, 48, 70,
//            OPAQUE_TEXT);
//
//            sprintf(string, "lux");
//            Graphics_drawStringCentered(&g_sContext, (int8_t *) string, 3, 86, 70,
//            OPAQUE
//        }

void ADC14_IRQHandler(void)
{
    uint64_t status;

    status = ADC14_getEnabledInterruptStatus();
    ADC14_clearInterruptFlag(status);

    /* ADC_MEM1 conversion completed */
    if (status & ADC_INT1)
    {
        /* Store ADC14 conversion results */
        resultsBuffer[0] = ADC14_getResult(ADC_MEM0);
        resultsBuffer[1] = ADC14_getResult(ADC_MEM1);

        (*states[currentState].selectionFunction)();
        render();
        //menuSelectionFunction();

