matteogastaldello/msp432-endpoint/main.c
    }
}

/////////////////////////////////////////////////////////////////////////////////////////////////////////
//CODICE DI COMUNICAZIONE

//WIFI UITLS HEADERS

/* Application specific status/error codes */
typedef enum
{
    DEVICE_NOT_IN_STATION_MODE = -0x7D0, /* Choosing this number to avoid overlap with host-driver's error codes */
    STATUS_CODE_MAX = -0xBB8
} e_AppStatusCodes;
/*
 * GLOBAL VARIABLES -- Start
 */
_u32 g_Status = 0;

struct
{
    _u8 Recvbuff[MAX_SEND_RCV_SIZE];
    _u8 SendBuff[MAX_SEND_BUF_SIZE];

    _u8 HostName[SMALL_BUF];

    _u32 DestinationIP;
    _i16 SockID;
} g_AppData;



/* Port1 ISR */
void PORT1_IRQHandler(void)
{
    /* Check which pins generated the interrupts */
    uint_fast16_t status = GPIO_getEnabledInterruptStatus(GPIO_PORT_P1);
    /* clear interrupt flag (to clear pending interrupt indicator */
    GPIO_clearInterruptFlag(GPIO_PORT_P1, status);
    /* check if we received P1.1 interrupt */
    if (status & GPIO_PIN1)
    {
        CLI_Write("Button 1.1 pressed\n");
        if (isConfigurationMode)
        {
            isConfigurationMode = false;
            CLI_Write(
                    "Returning to default state, configuration mode deactivated\n");
        }
        else
        {
            CLI_Write("Changing to Configuration Mode\n");
            isConfigurationMode = true;
        }
    }
}

void interruptSetup()
{
    //SETUP Button 1.1
    /* P1.1 as input for button */
    GPIO_setAsInputPinWithPullUpResistor(GPIO_PORT_P1, GPIO_PIN1);
    GPIO_enableInterrupt(GPIO_PORT_P1, GPIO_PIN1);
    GPIO_registerInterrupt(GPIO_PORT_P1, PORT1_IRQHandler);
    /* Enable interrupts on Port 1 (to catch P1.1 and P1.4 interrupts) */
    Interrupt_enableInterrupt(INT_PORT1);

    /* Enabling MASTER interrupts */
    Interrupt_enableMaster();
}

// Function designed for chat between client and server.
void configurationMode()
{
    CLI_Write("Conf Mode...\n");

    // Accept the data packet from client and verification
    connfd = SL_EAGAIN;
    while (connfd == SL_EAGAIN)
    {
        connfd = accept(sockfd, (SA*) &cli, &len);
        if (!isConfigurationMode)
            break;
    }

    if (!isConfigurationMode)
        return;

    if (connfd < 0)
    {
        CLI_Write("server accept failed...\n");
        exit(0);
    }
    else
        CLI_Write("server accept the client...\n");

    char buff[MAX];
    CLI_Write("Entering function...\n");
    uint32_t rcvd_bytes = 0;

    CLI_Write("Starting new read\n\r");
    int status = 0;
    bzero(buff, sizeof(buff));

    while (status != sizeof(buff))
    {
        do
        {
            status = sl_Recv(connfd, buff, sizeof(buff), 0);
        }
        while (status == SL_EAGAIN);
        char bf[100];
        sprintf(bf, "\nReceived packets (%d bytes) successfully\n\r", status);
        CLI_Write(bf);
        if (status < 0)
        {
            CLI_Write("TCP Error occured!\n");
            sl_Close(connfd);
            return (-1);
        }
        else if (status == sizeof(buff))
        {
            sl_Send(connfd, HANDSHAKE_ACK, sizeof(HANDSHAKE_ACK), 0);
        }
    }
    char tmp[100] = "";
    sprintf(tmp, "\nReceived %u packets (%u bytes) successfully\n\r",
            (status / 1), status);
    CLI_Write(tmp);
    sprintf(tmp, "\nMessage is: %s\n", buff);
    CLI_Write(tmp);
    status = 0;

    //sprintf(buff, "Closing Connection");
    // and send that buffer to client
    //sl_Send(connfd, buff, sizeof(buff), 0);
    // After chatting close the socket
    close(sockfd);

}

int communicationRoutine()
{
    int retVal;
    displayBanner();
    if (isConfigurationMode)
    {
        isConfigurationMode = false;
        CLI_Write(
                "Returning to default state, configuration mode deactivated\n");
    }
    else
    {
        CLI_Write("Changing to Configuration Mode\n");
        isConfigurationMode = true;
    }
    /*
     * Following function configures the dxevice to default state by cleaning
     * the persistent settings stored in NVMEM (viz. connection profiles &
     * policies, power policy etc)
     *
     * Applications may choose to skip this step if the developer is sure
     * that the device is in its default state at start of application
     *
     * Note that all profiles and persistent settings that were done on the
     * device will be lost
     */

    if (firstStart)
    {
        retVal = configureSimpleLinkToDefaultState();
        if (retVal < 0)
        {
            if (DEVICE_NOT_IN_STATION_MODE == retVal)
                CLI_Write(
                        " Failed to configure the device in its default state \n\r");
            LOOP_FOREVER();
        }

        CLI_Write(" Device is configured in default state \n\r");

        /*
         * Assumption is that the device is configured in station mode already
         * and it is in its default state
         */
        retVal = sl_Start(0, 0, 0);
        if ((retVal < 0) || (ROLE_STA != retVal))
        {
            CLI_Write(" Failed to start the device \n\r");
            LOOP_FOREVER();
        }
        CLI_Write(" Device started as STATION \n\r");
        firstStart = false;
    }
    else
        close(sockfd);

    /* Connecting to WLAN AP */
    retVal = establishConnectionWithAP();
    if (retVal < 0)
    {
        CLI_Write(" Failed to establish connection w/ an AP \n\r");
        LOOP_FOREVER();
    }

    CLI_Write(" Connection established w/ AP and IP is acquired \n\r");

    //close socket if not first start
//            if (!firstStart)
//                close(sockfd);

    // socket create and verification
    sockfd = socket(AF_INET, SOCK_STREAM, 0);

    if (sockfd == -1)
    {
        CLI_Write("socket creation failed...\n");
        exit(0);
    }
    else
        CLI_Write("Socket successfully created..\n");

    SlSockNonblocking_t enableOption;
    enableOption.NonblockingEnabled = 1;
    sl_SetSockOpt(sockfd, SL_SOL_SOCKET, SL_SO_NONBLOCKING,
                  (_u8*) &enableOption, sizeof(enableOption)); // Enable/disable nonblocking mode

