matteogastaldello/msp432-endpoint/main.c
    bzero(&servaddr, sizeof(servaddr));

    // assign IP, PORT
    servaddr.sin_family = AF_INET;
    servaddr.sin_addr.s_addr = htonl(INADDR_ANY);
    servaddr.sin_port = htons(PORT);

    // Binding newly created socket to given IP and verification
    if ((bind(sockfd, (SA*) &servaddr, sizeof(servaddr))) != 0)
    {
        CLI_Write("socket bind failed...\n");
        exit(0);
    }
    else
        CLI_Write("Socket successfully binded..\n");

    // Now server is ready to listen and verification
    if ((listen(sockfd, 5)) != 0)
    {
        CLI_Write("Listen failed...\n");
        exit(0);
    }
    else
        CLI_Write("Server listening..\n");
    len = sizeof(cli);

    //Function used to receive data from other devices
    configurationMode();

    //code end
    retVal = disconnectFromAP();
    if (retVal < 0)
    {
        CLI_Write(" Failed to disconnect from the AP \n\r");
        LOOP_FOREVER();
    }
}


//WIFI UTILS

/*
 * STATIC FUNCTION DEFINITIONS -- End
 */

/*
 * ASYNCHRONOUS EVENT HANDLERS -- Start
 */

/*!
 \brief This function handles WLAN events

 \param[in]      pWlanEvent is the event passed to the handler

 \return         None

 \note

 \warning
 */
void SimpleLinkWlanEventHandler(SlWlanEvent_t *pWlanEvent)
{
    if (pWlanEvent == NULL)
        CLI_Write(" [WLAN EVENT] NULL Pointer Error \n\r");

    switch (pWlanEvent->Event)
    {
    case SL_WLAN_CONNECT_EVENT:
    {
        SET_STATUS_BIT(g_Status, STATUS_BIT_CONNECTION);

        /*
         * Information about the connected AP (like name, MAC etc) will be
         * available in 'slWlanConnectAsyncResponse_t' - Applications
         * can use it if required
         *
         * slWlanConnectAsyncResponse_t *pEventData = NULL;
         * pEventData = &pWlanEvent->EventData.STAandP2PModeWlanConnected;
         *
         */
    }
        break;

    case SL_WLAN_DISCONNECT_EVENT:
    {
        slWlanConnectAsyncResponse_t *pEventData = NULL;

        CLR_STATUS_BIT(g_Status, STATUS_BIT_CONNECTION);
        CLR_STATUS_BIT(g_Status, STATUS_BIT_IP_ACQUIRED);

        pEventData = &pWlanEvent->EventData.STAandP2PModeDisconnected;

        /* If the user has initiated 'Disconnect' request, 'reason_code' is SL_USER_INITIATED_DISCONNECTION */
        if (SL_USER_INITIATED_DISCONNECTION == pEventData->reason_code)
        {
            CLI_Write(
                    " Device disconnected from the AP on application's request \n\r");
        }
        else
        {
            CLI_Write(" Device disconnected from the AP on an ERROR..!! \n\r");
        }
    }
        break;

    default:
    {
        CLI_Write(" [WLAN EVENT] Unexpected event \n\r");
    }
        break;
    }
}

/*!
 \brief This function handles events for IP address acquisition via DHCP
 indication

 \param[in]      pNetAppEvent is the event passed to the handler

 \return         None

 \note

 \warning
 */
void SimpleLinkNetAppEventHandler(SlNetAppEvent_t *pNetAppEvent)
{
    if (pNetAppEvent == NULL)
        CLI_Write(" [NETAPP EVENT] NULL Pointer Error \n\r");

    switch (pNetAppEvent->Event)
    {
    case SL_NETAPP_IPV4_IPACQUIRED_EVENT:
    {
        SET_STATUS_BIT(g_Status, STATUS_BIT_IP_ACQUIRED);

        /*
         * Information about the connected AP's IP, gateway, DNS etc
         * will be available in 'SlIpV4AcquiredAsync_t' - Applications
         * can use it if required
         *
         * SlIpV4AcquiredAsync_t *pEventData = NULL;
         * pEventData = &pNetAppEvent->EventData.ipAcquiredV4;
         * <gateway_ip> = pEventData->gateway;
         *
         */
    }
        break;

    default:
    {
        CLI_Write(" [NETAPP EVENT] Unexpected event \n\r");
    }
        break;
    }
}

/*!
 \brief This function handles callback for the HTTP server events

 \param[in]      pHttpEvent - Contains the relevant event information
 \param[in]      pHttpResponse - Should be filled by the user with the
 relevant response information

 \return         None

 \note

 \warning
 */
void SimpleLinkHttpServerCallback(SlHttpServerEvent_t *pHttpEvent,
                                  SlHttpServerResponse_t *pHttpResponse)
{
    /*
     * This application doesn't work with HTTP server - Hence these
     * events are not handled here
     */
    CLI_Write(" [HTTP EVENT] Unexpected event \n\r");
}

/*!
 \brief This function handles general error events indication

 \param[in]      pDevEvent is the event passed to the handler

 \return         None
 */
void SimpleLinkGeneralEventHandler(SlDeviceEvent_t *pDevEvent)
{
    /*
     * Most of the general errors are not FATAL are are to be handled
     * appropriately by the application
     */
    CLI_Write(" [GENERAL EVENT] \n\r");
}

/*!
 \brief This function handles socket events indication

 \param[in]      pSock is the event passed to the handler

 \return         None
 */
void SimpleLinkSockEventHandler(SlSockEvent_t *pSock)
{
    if (pSock == NULL)
        CLI_Write(" [SOCK EVENT] NULL Pointer Error \n\r");

    switch (pSock->Event)
    {
    case SL_SOCKET_TX_FAILED_EVENT:
    {
        /*
         * TX Failed
         *
         * Information about the socket descriptor and status will be
         * available in 'SlSockEventData_t' - Applications can use it if
         * required
         *
         * SlSockEventData_t *pEventData = NULL;
         * pEventData = & pSock->EventData;
         */
        switch (pSock->EventData.status)
        {
        case SL_ECLOSE:
            CLI_Write(
                    " [SOCK EVENT] Close socket operation failed to transmit all queued packets\n\r");
            break;

        default:
            CLI_Write(" [SOCK EVENT] Unexpected event \n\r");
            break;
        }
    }
        break;

    default:
        CLI_Write(" [SOCK EVENT] Unexpected event \n\r");
        break;
    }
}
/*
 * ASYNCHRONOUS EVENT HANDLERS -- End
 */

/*!
 \brief Gets the Server IP address

